[
    {
        "id": "0",
        "name": "Game & Watch",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://d3ecqbn6etsqar.cloudfront.net/B5Wi5g5QsAuDFQ3aNk5GoVWYEMI=/3000x0/smart/168029.jpg",
            "alt": "Nintendo Game & Watch"
        },
        "year": 1980,
        "dimensions": "112 x 67 x 12.5 mm",
        "weight": "68g",
        "material": "metal/plastic",
        "description": "<p>The Game and Watch series was a successful line of products from Nintendo that generated enough profit for the company to invest heavily in researching and developing the Nintendo Entertainment System (NES) and the Gameboy.</p><p>This ensured the company's survival and dominance through a competitive period of electronic game industry development, consumption and growth. These small hand-held games broke new ground in the application of electronics to toys. They have a monochrome LCD (liquid crystal display) screen on which the player can control the movement of characters through a themed set of tasks.</p><p>The balance between an achievable outcome and a degree of difficulty invited the user to play the game again and again, thus achieving one of the principal goals of electronic game design.</p>"
    },
    {
        "id": "1",
        "name": "Game Boy",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://i.pcmag.com/imagery/lineups/015k0fRLLfJ8XW1SnPlWpeJ-1.1571362379.fit_lim.size_1600x900.jpg",
            "alt": "Nintendo Gameboy"
        },
        "year": 1989,
        "dimensions": "148 x 90 x 32 mm",
        "weight": "220g",
        "material": "plastic / rubber / electronic components",
        "description": "<p>The Game Boy is the most popular game console in history (2003) selling in excess of 64 million units since its inception in 1989 through to 1998 when Nintendo began production of the Game Boy colour model. A major contribution to the success of the Game Boy was the decision to bundle the Tetris game with all purchases in the USA and other countries.</p><p>The Game Boy became a wearable accessory in a similar sense to the Sony \"Walkman\" - it was personalised and principally used exclusively by the owner in private and public spaces. The use of this type (wearable, electronic) of device in public spaces tends to isolate the users from their surroundings.</p><p>To many this practice is perceived as non-social behaviour. It is interesting to note recent studies of behaviour and etiquette in public spaces by users of these technologies including mobile phones, digital assistants and other wireless (WAP) devices that expose the general abhorrence yet tolerance of their use.</p>"
    },
    {
        "id": "2",
        "name": "Game Boy Pocket",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://external-preview.redd.it/Rb5xnM08BswvG8EesIiSB_imjtM0FqWggNTXlPafFm8.jpg?auto=webp&s=bce0f2c5ba50be77abd89dd6300a70d3cdbda75b",
            "alt": "Nintendo Game Boy Pocket"
        },
        "year": 1996,
        "dimensions": "127.6 x 77.6 x 25.3 mm",
        "weight": "125 g",
        "material": "metal/plastic",
        "description": "<p>The Game Boy Pocket is the first redesigned version of the original Game Boy having the same features released in 1996. Notably, this variation is smaller and lighter.</p><p>Another notable improvement over the original Game Boy includes a black-and-white display screen, rather than the \"pea soup\" monochromatic display of the original Game Boy and less sprite blurs. The Game Boy Pocket takes two AAA batteries as opposed to four AA batteries for roughly ten hours of gameplay. The first model of the Game Boy Pocket did not have an LED to show battery levels, but was added in favor of public demand.</p>"
    },
    {
        "id": "3",
        "name": "Game Boy Color",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://1.bp.blogspot.com/-73awDWchuSA/Xqqad7dzpSI/AAAAAAAAXVo/B9m_LWuXmk0VWCEUycX2fHcbQsdg0vocQCLcBGAsYHQ/s1600/d422416daa0292dabcdbb5e4d4b274c1.jpg",
            "alt": "Nintendo Game Boy Color"
        },
        "year": 1998,
        "dimensions": "133.5 x 78 x 27.4 mm",
        "weight": "138 g",
        "material": "metal/plastic",
        "description": "<p>The Game Boy Color (commonly abbreviated as GBC) is a handheld game console, manufactured by Nintendo, which was released in Japan on October 21, 1998 and to international markets that November. It is the successor to the original Game Boy and is part of the Game Boy family.</p><p>The GBC features a color screen rather than monochrome, but it is not backlit. It is slightly thicker and taller and features a slightly smaller screen than the Game Boy Pocket, its immediate predecessor in the Game Boy line. As with the original Game Boy, it has a custom 8-bit processor made by Sharp that is considered a hybrid between the Intel 8080 and the Zilog Z80. The American English spelling of the system's name, Game Boy Color, remains consistent throughout the world.</p>"
    },
    {
        "id": "4",
        "name": "Game Boy Advance",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://static.turbosquid.com/Preview/2019/10/09__00_19_52/GameboyAdvance_01.jpg2A0E50B1-4544-4F36-8CFB-203141D4D53BDefault.jpg",
            "alt": "Nintendo Game Boy Advance"
        },
        "year": 2001,
        "dimensions": "144 x 82 x 24.5 mm",
        "weight": "140 g",
        "material": "metal/plastic",
        "description": "<p>In Japan, on March 21, 2001, Nintendo released a significant upgrade to the Game Boy line. The Game Boy Advance (also referred to as GBA) featured a 32 bit 16.8 MHz ARM. It included a Z80 processor and a switch activated by inserting a Game Boy or Game Boy Color game into the slot for backward compatibility, and had a larger, higher resolution screen.</p><p>Controls were slightly modified with the addition of \"L\" and \"R\" shoulder buttons. Like the Game Boy Light and Game Boy Color, the Game Boy Advance takes on two AA batteries. The system was technically likened to the SNES and showed its power with successful ports of SNES titles such as Super Mario World, Super Mario World 2: Yoshi's Island, The Legend of Zelda: A Link to the Past and Donkey Kong Country.</p>"
    },
    {
        "id": "5",
        "name": "DS",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://cdn.vox-cdn.com/thumbor/wfls11r_BYGIFKUgWI6D-FKps7A=/0x0:3309x2045/1200x800/filters:focal(1391x759:1919x1287)/cdn.vox-cdn.com/uploads/chorus_image/image/61839397/3801067849_0ee5b3415e_o.0.jpg",
            "alt": "Nintendo DS"
        },
        "year": 2000,
        "dimensions": "48.7 x 84.7 x 28.9 mm",
        "weight": "275 g",
        "material": "metal/plastic",
        "description": "<p>The Nintendo DS is a handheld game console produced by Nintendo, released globally across 2004 and 2005. The DS, an initialism for \"Developers' System\" or \"Dual Screen\", introduced distinctive new features to handheld games: two LCD screens working in tandem (the bottom one being a touchscreen), a built-in microphone and support for wireless connectivity. Both screens are encompassed within a clamshell design similar to the Game Boy Advance SP.</p><p>The Nintendo DS also features the ability for multiple DS consoles to directly interact with each other over Wi-Fi within a short range without the need to connect to an existing wireless network. Alternatively, they could interact online using the now-defunct Nintendo Wi-Fi Connection service. Its main competitor was Sony's PlayStation Portable during the seventh generation of video game consoles.</p>"
    },
    {
        "id": "6",
        "name": "3DS",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://img.redbull.com/images/c_fill,w_1500,h_1000,g_auto,f_auto,q_auto/redbullcom/2014/07/17/1331665280278_2/fixed-that-for-you-10-ways-to-make-the-3ds-king",
            "alt": "Nintendo 3DS"
        },
        "year": 2011,
        "dimensions": "130 x 74 x 20 mm",
        "weight": "230 g",
        "material": "metal/plastic",
        "description": "<p>The Nintendo 3DS is a handheld game console produced by Nintendo. It was announced in March 2010 and unveiled at E3 2010 as the successor to the Nintendo DS. The system features backward compatibility with older Nintendo DS video games. As an eighth-generation console, its primary competitor was Sony's PlayStation Vita.</p><p>The handheld's most prominent feature is its ability to display stereoscopic 3D effects without the use of 3D glasses or additional accessories, and offers new features such as the StreetPass and SpotPass tag modes, powered by Nintendo Network; augmented reality using its 3D cameras; and Virtual Console, which allows owners to download and play games originally released on older video game systems.</p>"
    },
    {
        "id": "7",
        "name": "3DS XL",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://cdn.vox-cdn.com/thumbor/9Df6xwegyCpLxUVPgixvWSruG5k=/0x0:1019x679/1200x800/filters:focal(0x0:1019x679)/cdn.vox-cdn.com/uploads/chorus_image/image/45673542/zelda3ds.0.0.jpg",
            "alt": "Nintendo 3DS XL"
        },
        "year": 2012,
        "dimensions": "160 x 254 x 21.5 mm",
        "weight": "336 g",
        "material": "metal/plastic",
        "description": "<p>Rumors of a larger model of the Nintendo 3DS being in production appeared during June 2012, when Japanese publication Nikkei wrote an article stating that the system was initially scheduled to be unveiled at E3 2012. However, Nintendo responded that these rumors were false and that the article was \"entire speculation\", but refrained from further commenting on the subject.</p><p>Finally, on June 21, 2012, the system was announced during a Nintendo Direct presentation. Featuring 90% larger screens than the original Nintendo 3DS, the system was set to launch on all major regions during the middle of the year.</p>"
    },
    {
        "id": "8",
        "name": "2DS",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://www.cnet.com/a/img/2T6tfFJ5FKRk2owg6cbRz-x2bHY=/1200x675/2013/09/27/b6ecbd2c-6791-11e3-846b-14feb5ca9861/Nintendo_2DS_35826997_35826996_14.jpg",
            "alt": "Nintendo 2DS"
        },
        "year": 2013,
        "dimensions": "160 x 254 x 21.5 mm",
        "weight": "260 g",
        "material": "metal/plastic",
        "description": "<p>The Nintendo 2DS (abbreviated to 2DS) was announced on August 28, 2013, as a new entry-level model of the Nintendo 3DS family. While its hardware and software are relatively similar to the Nintendo 3DS (and still offers compatibility with Nintendo DS and 3DS games), it lacks the 3DS's signature 3D screen, does not have internal stereo speakers (only using a mono speaker), and uses a slate-like form factor as opposed to the clamshell design used by its Nintendo DS and 3DS predecessors.</p><p>The Nintendo 2DS was released in North America and Europe on October 12, 2013, coinciding with the launch of Pokémon X & Y and is being sold alongside the Nintendo 3DS and 3DS XL at a relatively lower price point.</p>"
    },
    {
        "id": "9",
        "name": "Switch",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://cdn.pocket-lint.com/r/s/1200x/assets/images/140007-games-review-nintendo-switch-review-image1-lp6zy9awm0.jpg",
            "alt": "Nintendo Switch"
        },
        "year": 2017,
        "dimensions": "239 x 102 x 13.9 mm",
        "weight": "400 g",
        "material": "metal/plastic",
        "description": "<p>The Nintendo Switch is a video game console developed by Nintendo and released worldwide in most regions on March 3, 2017. The console itself is a tablet that can either be docked for use as a home console or used as a portable device, making it a hybrid console.</p><p>Its wireless Joy-Con controllers, with standard buttons and directional analog sticks for user input, motion sensing, and tactile feedback, can attach to both sides of the console to support handheld-style play. They can also connect to a grip accessory to provide a traditional home console gamepad form, or be used individually in the hand like the Wii Remote and Nunchuk, supporting local multiplayer modes. </p>"
    },
    {
        "id": "10",
        "name": "Switch Lite",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://cdn.vox-cdn.com/thumbor/QEO3DhuKgKF0ANgRJJGLjOV34sk=/0x0:2040x1360/1200x675/filters:focal(857x517:1183x843)/cdn.vox-cdn.com/uploads/chorus_image/image/69030767/mmcwhertor_190819_ply0943_switch_0043.0.jpg",
            "alt": "Nintendo Switch Lite"
        },
        "year": 2019,
        "dimensions": "208 x 91 x 14 mm",
        "weight": "276 g",
        "material": "metal/plastic",
        "description": "<p>The Nintendo Switch Lite is a handheld game console by Nintendo. It was released on September 20, 2019, as a handheld-only version of the Nintendo Switch. It plays most of the same games as the original Nintendo Switch and comes in five colors. The Nintendo Switch Lite was unveiled on July 10, 2019 and was known in development by its codename MH.</p><p>According to The Wall Street Journal, Nintendo's goal with the Switch Lite was to produce a sub US$200 unit, aimed at casual gamers, to compete with gaming services that do not require a dedicated device. To achieve this, Nintendo aggressively negotiated on reduced prices from its component suppliers.</p>"
    },
    {
        "id": "11",
        "name": "Game & Watch Super Mario Bros",
        "maker": "Nintendo Company Limited",
        "img": {
            "src": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/nintendo-game-watch-1605227144.jpg",
            "alt": "Nintendo Game & Watch Super Mario Bros"
        },
        "year": 2021,
        "dimensions": "112 x 67 x 12.5 mm",
        "weight": "68 g",
        "material": "metal/plastic",
        "description": "<p>Game & Watch: Super Mario Bros. was a limited-edition Game & Watch game developed and published by Nintendo, released on November 13, 2020. The game is a compilation of three prior Nintendo games, Super Mario Bros., Super Mario Bros.: The Lost Levels (known as Super Mario Bros. 2 in Japan), and Ball. The game was released to commemorate the 35th anniversary of the Super Mario series, as well as the 40th anniversary of the Game & Watch line of systems.</p>"
    }
]